'''7. Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
При вызове функции должен создаваться объект-генератор. Функция должна вызываться следующим образом: for el in fibo_gen().
Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые 15 чисел.
Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.'''

print(list(range(1, 16)))


def fibo_gen(n):
    x = 1
    for el in range(1, n):
        x = x * el
        yield x


print(fibo_gen(16))

for el in fibo_gen(16):
    print(el)
